tutorials/floatRigidBody/floatRigidBody_partioned_gravity/0.orig/beamone/K
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceVectorField;
    location    "2";
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<vector> 
39
(
(5.32693772559e-19 -0.117558340442 3.46103478e-14)
(5.65764093622e-19 -0.208473927197 6.1386336037e-14)
(1.92066115217e-19 -0.278675321298 8.20746167596e-14)
(-4.83404547214e-19 -0.332775104929 9.80341951212e-14)
(-1.31935973572e-18 -0.374361075006 1.1032121594e-13)
(-2.15640831809e-18 -0.406223179954 1.1975552663e-13)
(-2.83536838204e-18 -0.43053031274 1.26972856174e-13)
(-3.24838286752e-18 -0.44896799059 1.32465876802e-13)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (-2.32359467365e-31 1.56184817104e-32 1.28886380324e-31);
    }
    right
    {
        type            calculated;
        value           uniform (-8.29060839893e-32 3.36385305292e-32 -1.20429561973e-31);
    }
    beam
    {
        type            empty;
        value           nonuniform List<vector> 0();
    }
}


// ************************************************************************* //
