tutorials/floatRigidBody/floatRigidBody_partioned_gravity/0.orig/beamone/Theta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "2";
    object      Theta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<vector> 
40
(
(4.1290817011e-12 0.0478326407478 -6.00863262827e-12)
(4.11057807715e-12 0.0471394887701 -5.97942343542e-12)
(4.07418154405e-12 0.0459102768369 -5.92207684277e-12)
(4.01786950885e-12 0.044267140762 -5.8333540721e-12)
(3.93959159648e-12 0.0423050194763 -5.70995666449e-12)
(3.83773024128e-12 0.0400976974053 -5.54925863292e-12)
(3.71132718052e-12 0.0377025087739 -5.34966893599e-12)
(3.5601526794e-12 0.0351639994977 -5.11074541433e-12)
...
)
;

boundaryField
{
    left
    {
        type            momentBeamRotationNR;
        value           uniform (4.1290817011e-12 0.0478326407478 -6.00863262827e-12);
        momentSeries    
{
        file            "$FOAM_CASE/constant/beamone/timeVsMoment";
        outOfBounds     clamp;
}
        moment          uniform (0 0 0);
    }
    right
    {
        type            momentBeamRotationNR;
        value           uniform (-3.50643855461e-12 -0.0465641082632 6.2056184778e-12);
        momentSeries    
{
        file            "$FOAM_CASE/constant/beamone/timeVsMoment";
        outOfBounds     clamp;
}
        moment          uniform (0 0 0);
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
