tutorials/floatRigidBody/floatRigidBody_partioned_gravity/0.orig/beamone/refLambda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volTensorField;
    location    "0";
    object      refLambda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (0.847998304005 0 -0.529998940003 0 1 0 0.529998940003 0 0.847998304005);

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (0.847998304005 0 -0.529998940003 0 1 0 0.529998940003 0 0.847998304005);
    }
    right
    {
        type            calculated;
        value           uniform (0.847998304005 0 -0.529998940003 0 1 0 0.529998940003 0 0.847998304005);
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
